Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: དེས་གལ་ཏེ་བསམ་པ་རྣམ་པར་སྦྱང་བར་བྱས་ན་དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: If they act with pure intentions, their related karmic obscurations will be purified and they will find release in awakening.

source: གང་གིས་བདག་ཁ་དོག་དང་ལྡན་པའི་མེ་ཏོག་སིལ་མ་དག་སྲེལ་བར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་རོ། །
en: “If they perceive themselves holding colorful flower petals, they are on the first bhūmi.

source: དྲི་དང་ལྡན་པས་ནི་ས་གཉིས་པར་རོ། །
en: Fragrant flower petals indicate the second bhūmi.

source: རེག་དང་ལྡན་པས་ནི་ས་གསུམ་པར་རོ། །
en: Flower petals with a nice texture indicate the third bhūmi.

source: སྣ་ཚོགས་ཀྱིས་ནི་ས་བཞི་པར་རོ། །
en: Various kinds of flower petals indicate the fourth bhūmi.

source: ཆུ་ལས་སྐྱེས་པ་དང་། སྐམ་ལས་སྐྱེས་པས་ནི་ས་ལྔ་པར་རོ། །
en: Petals of flowers from the water or ground indicate the fifth bhūmi.

source: ཐམས་ཅད་ཁ་འབུས་པར་གྱུར་པས་ནི་ས་དྲུག་པར་ཏེ།
en: Flowers that are all blossoms indicate the sixth bhūmi.

source: ས་གོང་མ་བཞི་པོ་དག་ལ་མངོན་པར་བརྩོན་པའམ།
en: These are the signs for those who endeavored on the four higher bhūmis.

source: བདུད་ཀྱི་ལས་ཀྱི་མཚན་མ་ནི་དེ་དག་ཡིན་ཏེ།
en: These signs may be the activity of Māra.

source: ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་མི་འོང་བ་ཐམས་ཅད་ཀྱང་འབུལ་བར་བྱེད་དོ། །
en: Such bodhisattvas should offer everything, be it pleasant or unpleasant.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྔ་བོ་ཆེ་རྡུང་བའམ། །རོལ་མོའི་སྒྲ་འབྱིན་པར་ཀུན་ཏུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 87. “Vajrapramardin, if in a dream bodhisattvas perceive themselves beating a great drum or making other musical sounds, consider those bodhisattvas to be on one of the first nine bhūmis.

source: དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་དང་། བདུད་ཀྱི་ལས་ཤས་ཆེ་བ་ཡིན་པས་དེས་བརྩོན་འགྲུས་བརྩམ་ཞིང་ཐོས་པ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: They are dominantly affected by karmic obscurations and Māra’s influence.

source: དེས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པར་བྱའོ། །
en: Such bodhisattvas should therefore be diligent, endeavor in their studies, and regard all beings as equal.

source: གང་ཐིབས་པོར་སོང་སྟེ་རྔ་བོ་ཆེ་རྡུང་བར་བྱེད་ན་དེ་ནི་ས་དང་པོ་པར་རོ། །
en: “If those bodhisattvas enter the deep wilderness beating a great drum, they are on the first bhūmi.

source: གང་ས་མཉམ་པར་སོང་སྟེ་རྡུང་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they go to a plain with the drum, they are on the second bhūmi.

source: གང་གྲོང་དུ་སོང་སྟེ་རྡུང་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they enter a town with the drum, they are on the third bhūmi.

source: གང་གྲོང་ཁྱེར་ཆེན་པོར་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they enter a large city with the drum, they are on the fourth bhūmi.

source: གང་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དབུས་སུ་ན་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they are in the middle of a great crowd, they are on the fifth bhūmi.

source: གང་སྐྱབས་སུ་སོང་སྟེ་ན་དེ་ནི་ས་དྲུག་པར་རོ། །
en: If they have taken refuge, they are on the sixth bhūmi.

source: གང་རི་ལ་ན་དེ་ནི་ས་བདུན་པར་རོ། །
en: If they are on a mountain, they are on the seventh bhūmi.

source: གང་རི་བོའི་རྩེ་མོར་ན་དེ་ནི་ས་བརྒྱད་པར་རོ། །
en: If they are on a mountain summit, they are on the eighth bhūmi.

source: གང་ནམ་མཁའ་ལ་འདུག་སྟེ་ན་དེ་ནི་ས་དགུ་པར་རོ། །
en: If they are in the sky, they are on the ninth bhūmi.

source: ཡེ་ཤེས་ལ་བརྩོན་པ་ལ་བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །
en: For those who endeavor in wisdom, these signs may be the activity of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཉི་མ་གཟས་ཟིན་པའམ་ཟླ་བ་གཟས་ཟིན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 88. “Vajrapramardin, if in a dream bodhisattvas witness an eclipse of the sun or the moon, consider those bodhisattvas to be on one of the first six bhūmis.

source: ཆོས་ཀྱིས་ཕོངས་པར་འགྱུར་བའི་ལས་དང་ལྡན་ཞིང་ཉོན་མོངས་པ་མང་བ་ཡིན་པས་དེས་ནི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བར་བྱ་ཞིང་།
en: They have the karma to be bereft of the Dharma and have many afflictions.

source: རྣམ་པར་སྨིན་པ་མི་འདོད་པ་ལ་ཡང་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: They should therefore give away their possessions and make an effort to not wish for a favorable outcome from that act.

source: ཉི་མ་འམ་ཟླ་བ་འཆར་ཀར་གཟས་ཟིན་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas witness an eclipse of the rising sun or the moon, consider them to be on the first bhūmi.

source: སྔ་དྲོའི་དུས་སུ་ན་ས་གཉིས་པར་རོ། །
en: If it is witnessed in the morning, consider them to be on the second bhūmi.

source: སྤྲིན་ཡང་འཁྲུགས་ན་ས་གསུམ་པར་རོ། །
en: If it is witnessed amid turbulent clouds, they are on the third bhūmi.

source: རླུང་ཡང་འཁྲུགས་ན་ས་བཞི་པར་རོ། །
en: If it is witnessed during turbulent wind, they are on the fourth bhūmi.

source: རྡུལ་གྱིས་ངེས་པར་བཅོམ་ན་ས་ལྔ་པར་རོ། །
en: If it is obscured by dust, they are on the fifth bhūmi.

source: ཉི་མ་ཕྱེད་པའི་དུས་སུ་ན་ས་དྲུག་པར་ཏེ།
en: If it is witnessed at noon, they are on the sixth bhūmi.

source: ལས་ཀྱི་སྒྲིབ་པ་དང་། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །
en: These are the signs, unless they are the activity of Māra or the results of karmic obscurations.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་མི་གཙང་བས་བསྐུས་པར་ཀུན་ཏུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 89. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be covered in filth, consider those bodhisattvas to be on one of the first three bhūmis.

source: སྔོན་འཕགས་པ་ལ་སྐུར་པ་བཏབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དམུ་རྒོད་ཡིན་པས་དེས་ལོ་གསུམ་དུ་ཕུང་པོ་གསུམ་པ་ལ་ཇི་ལྟར་ལུང་ཕོག་པ་བཞིན་དུ་གདོན་པར་བྱ་ཞིང་། གང་ལ་ཡང་མ་དད་པར་མི་བྱ་བར་མོས་པ་ཡང་མང་དུ་བྱའོ། །
en: Because they are irascible bodhisattvas who had previously denigrated noble beings, they should recite the Three Sections according to instructions for three years, and should increase their conviction so that they do not lack for faith in anything.

source: ལུས་ཐམས་ཅད་མི་གཙང་བའི་རྫབ་ཀྱིས་བསྐུས་ན་ས་དང་པོ་པར་རོ། །
en: “If their entire body is covered with muck, they are on the first bhūmi.

source: ལུས་ཀྱི་གཞོགས་ཕྱེད་བསྐུས་ན་ས་གཉིས་པར་རོ། །
en: If half their body is covered, they are on the second bhūmi.

source: ཡན་ལག་དང་ཉིང་ལག་བསྐུས་ན་ས་གསུམ་པར་རོ། །
en: If their major and minor limbs are covered, they are on the third bhūmi.

source: ས་དྲུག་པའི་བར་དག་ལ་ནི་བདུད་ཀྱི་ལས་སུ་རྟོགས་པར་བྱའོ། །
en: Up to the sixth bhūmi, these signs may be the work of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྒྱལ་པོར་གྱུར་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 90. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be a king, consider those bodhisattvas to be on any of the ten bhūmis.

source: དེ་ལ་དགེ་བའི་རྩ་བ་སྟུག་ལ་བར་ཆད་ཀྱང་སྟུག་པ་ཡིན་པས་དེས་ན་རློམ་སེམས་མེད་པར་བྱ་ཞིང་གཞན་ལ་གཡོ་མི་བྱ་བ་དང་། ཀུན་བགེད་པའི་ངང་ཚུལ་ཅན་དང་། བདག་ལ་མི་བསྟོད་པ་དང་། གཞན་ལ་མི་སྨད་པར་བྱའོ། །
en: They have firm virtuous roots but also thick obscurations, and should therefore free themselves of conceit, avoid deceiving others, maintain a cheerful demeanor in all circumstances, not praise themselves, and not criticize others.

source: གྲོང་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they perceive themselves as a king in a town, consider them to be on the first bhūmi.

source: གཙུག་ལག་ཁང་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they perceive themselves as a king in a monastery, consider them to be on the second bhūmi.

source: སྐྱེད་མོས་ཚལ་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they perceive themselves as a king in a pleasure garden, consider them to be on the third bhūmi.

source: ལྷ་ཁང་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they perceive themselves as a king in a temple, consider them to be on the fourth bhūmi.

source: གྲོང་ཁྱེར་ཆེན་པོ་ན་འདུག་སྟེ། རྒྱལ་པོར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they perceive themselves as a king in a city, consider them to be on the fifth bhūmi.

source: རིའི་རྩེ་མོ་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they perceive themselves as a king on the summit of a mountain, consider them to be on the sixth bhūmi.

source: འཛམ་བུའི་གླིང་གི་རྒྱལ་པོར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they perceive themselves as the king of Jambudvīpa, consider them to be on the seventh bhūmi.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they perceive themselves as a cakravartin king, consider them to be on the eighth bhūmi.

source: རྒྱ་མཚོའི་དབུས་སུ་ན་དེ་ནི་ས་དགུ་པར་བལྟའོ། །
en: If they perceive themselves in the middle of the ocean, consider them to be on the ninth bhūmi.

source: རི་རབ་ཀྱི་རྩེ་མོར་ན་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ།
en: If they perceive themselves at the summit of Mount Meru, consider them to be on the tenth bhūmi.

source: བདུད་ཀྱི་ལས་ལ་མངོན་པར་བརྩོན་པ་དང་། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔས་མ་དགོངས་པ་ནི་མ་གཏོགས་སོ། །
en: These may be the signs of those who endeavor in the activities of Māra and of those whom the buddhas and bodhisattvas do not think of.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྒྱལ་པོའི་སྤྱན་སྔ་འམ། རྒྱལ་པོའི་བློན་པོ་ཆེན་པོའམ། །སྐྱེ་བོ་ཕལ་པོ་ཆེའི་མདུན་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 91. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be in the presence of a king, the king’s prime minister, or a large crowd of people, consider those bodhisattvas to be on one of the first eight bhūmis.

source: ཀུན་ནས་ཉོན་མོངས་པ་དང་བཅས་པ་ཡིན་པས་དེས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་ཞིང་ཉེ་དུའི་མཆོད་པ་སྤང་བར་བྱ་བ་དང་། ཤིན་ཏུ་ཡོངས་སུ་དག་པར་བྱའོ། །
en: They are rife with defilements, and so should bring beings to maturity, stop favoring close relations, and purify themselves.

source: དེ་ལ་སྦྱིན་པས་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་ན་ས་དང་པོ་པར་རོ། །
en: “If they become defiled through generosity, they are on the first bhūmi.

source: ཚུལ་ཁྲིམས་ཀྱིས་ནི་ས་གཉིས་པར་རོ། །
en: If through discipline, they are on is the second bhūmi.

source: ཐོས་པས་ནི་ས་གསུམ་པར་རོ། །
en: If through learning, they are on the third bhūmi.

source: ཏིང་ངེ་འཛིན་གྱིས་ནི་ས་བཞི་པར་རོ། །
en: If through samādhi, they are the fourth bhūmi.

source: གཟུངས་ཀྱིས་ནི་ས་ལྔ་པར་རོ། །
en: If through dhāraṇī, they are on the fifth bhūmi.

source: མངོན་པར་ཤེས་པ་རྣམས་ཀྱིས་ནི་ས་དྲུག་པར་རོ། །
en: If through the extrasensory cognitions, they are on the sixth bhūmi.

source: ཆོས་སྟོན་པས་ནི་ས་བདུན་པར་རོ། །
en: If through teaching the Dharma, they are on the seventh bhūmi.

source: གཡོག་འཁོར་ཕུན་སུམ་ཚོགས་པས་ནི་ས་བརྒྱད་པར་རོ། །
en: If through their excellent retinue, they are on the eighth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སྐྱེད་མོས་ཚལ་དུ་སོན་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དགུ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 92. “Vajrapramardin, if in a dream bodhisattvas perceive that they have arrived in a pleasure garden, consider those bodhisattvas to be on one of the first nine bhūmis.

source: དེས་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: Such bodhisattvas should endeavor in the perfection of meditation.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་འཇིག་རྟེན་གྱི་ཟང་ཟིང་ནི་རྙེད་ལ། ཤེས་པས་ནི་མ་ཡིན་པས་བདུད་ཀྱི་ལྕགས་ཀྱུས་ཀུན་ཏུ་དྲངས་པ་ཡིན་ཏེ།
en: Because those bodhisattvas are not prudent in their acquisition of worldly pleasures, they are led about by Māra’s hook.

source: ལས་ཀྱི་སྒྲིབ་པ་ནི་ཆུང་ངོ་། །
en: Their karmic obscurations are few, however.

source: དེས་ན་ཆོས་སྨྲ་བ་ལ་ཉེ་བར་འཚོ་བ་དག་བསྒྲུབ་པར་བྱ་ཞིང་ནང་དུ་ཡང་དག་འཇོག་ཀྱང་བསྒྲུབ་པར་བྱའོ། །
en: They should provide support for Dharma teachers and maintain an inward focus.

source: དེ་ལ་ས་དང་པོ་ལ་ནི་སྤྱོད་པའི་ཤེས་པ་མེད་དོ། །
en: “Novice bodhisattvas do not understand conduct.

source: ས་གཉིས་པ་ལ་ནི་ཐོས་པའི་ཤེས་པ་མེད་དོ། །
en: Those on the second bhūmi do not understand learning.

source: ས་གསུམ་པ་ལ་ནི་ངེས་པའི་ཤེས་པ་མེད་དོ། །
en: Those on the third bhūmi lack certitude.

source: ས་བཞི་པ་ལ་ནི་བསམ་གཏན་གྱི་ཤེས་པ་མེད་དོ། །
en: Those on the fourth bhūmi do not understand meditation.

source: ས་ལྔ་པ་ལ་ནི་གཟུངས་ཀྱི་ཤེས་པ་མེད་དོ། །
en: Those on the fifth bhūmi do not understand dhāraṇī.

source: ས་དྲུག་པ་ལ་ནི་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཤེས་པ་མེད་དོ། །
en: Those on the sixth bhūmi do not understand the discernments.

source: ས་བདུན་པ་ལ་ནི་སྒྲུབ་པའི་ཤེས་པ་མེད་དོ། །
en: Those on the seventh bhūmi do not understand practice.

source: ས་བརྒྱད་པ་ལ་ནི་བཀོད་པའི་ཤེས་པ་མེད་དོ། །
en: Those on the eighth bhūmi do not understand magnificent displays.

source: ས་དགུ་པ་ལ་ནི་སྨོན་ལམ་གྱི་ཤེས་པ་མེད་དོ། །
en: Those on the ninth bhūmi do not understand aspirations. 93.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་གཙུག་ལག་ཁང་ངམ། གྲོང་ངམ། ཡུལ་ལམ། ལྗོངས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ། །
en: “Vajrapramardin, if in a dream bodhisattvas see a monastery, town, region, or country that they have never seen before, consider those bodhisattvas to be on one of the first six bhūmis.

source: དེ་ནི་བར་ཆད་མང་བ་ཡིན་པས་དེས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བྱ་ཞིང་དད་པར་ཡང་བྱ། བྱ་བ་ཐམས་ཅད་ལ་དད་པའི་སྦྱིན་པས་མོས་པར་ཡང་བྱའོ། །
en: Because they have many obstacles, they should train in recollecting the Buddha, develop faith, and forge conviction through their pious generosity in all activities.

source: གང་གིས་མཚན་མའི་བྱ་བ་དེ་དག་བྱི་དོར་མ་བྱས་པར་མཐོང་ན་དེ་ནི་ས་དང་པོར་རོ། །
en: “If those bodhisattvas see that no one has cleared away those signs, they are on the first bhūmi.

source: གང་གིས་བྱི་དོར་བྱས་པར་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they see that someone has cleared them away, they are on the second bhūmi.

source: གང་གིས་རྒྱན་གྱིས་བརྒྱན་པར་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they see that someone has hung decorations, they are on the third bhūmi.

source: འཁོར་བཞི་པོ་དག་འདུས་ན་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they see that the fourfold community has gathered, they are on the fifth bhūmi.

source: ལྷའི་འཁོར་དག་འདུས་ན་དེ་ནི་ས་དྲུག་པར་རོ། །
en: If they see that the assemblies of the gods have gathered, they are on the sixth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན། གདུགས་རྙེད་ན་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ། །
en: 94. “Vajrapramardin, if in a dream bodhisattvas find a parasol, consider those bodhisattvas to be on one of the first seven bhūmis.

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱང་ཡོད། བར་ཆད་ཀྱང་མང་། མི་ཆོམས་པ་ཡང་ཡིན་ནོ། །
en: Such bodhisattvas have been blessed by the Buddha and have many obstacles, but have not been overwhelmed by them.

source: དེས་ནི་ཆོས་སྨྲ་བ་ལ་བརྙས་པར་མི་བྱ་སྟེ།
en: They should refrain from belittling Dharma teachers.

source: དེ་ལ་ལོ་མའི་གདུགས་ཀྱིས་ནི་ས་དང་པོར་རོ། །
en: “If the parasol is made out of leaves, those bodhisattvas are on the first bhūmi.

source: འོད་མའི་གདུགས་ཀྱིས་ནི་ས་གཉིས་པར་རོ། །
en: If the parasol is made of bamboo, they are on the second bhūmi.

source: གྲོ་བའི་གདུགས་ཀྱིས་ནི་ས་གསུམ་པར་རོ། །
en: If the parasol is made of birch, they are on the third bhūmi.

source: རས་ཀྱི་གདུགས་ཀྱིས་ནི་ས་བཞི་པར་རོ། །
en: If the parasol is made of cloth they are on the fourth bhūmi.

source: ཁྲ་བོས་ནི་ས་ལྔ་པར་རོ། །
en: If the parasol is multicolored, they are on the fifth bhūmi.

source: དྲིལ་བུ་གཡེར་ཀས་ཡོངས་སུ་བསྐོར་བས་ནི་ས་དྲུག་པར་རོ། །
en: If it is trimmed with small bells, they are on the sixth bhūmi.

source: རིན་པོ་ཆེའི་དྲ་བས་གླགས་པས་ནི་ས་བདུན་པར་རོ། །
en: If it is laced with jewels, they are on the seventh bhūmi.

source: བདུད་ཀྱི་ལས་དང་། མངོན་པར་མི་བརྩོན་པ་ནི་མ་གཏོགས་སོ། །
en: These are the signs, unless they are the activity of Māra or are due to a lack of effort.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དབུས་ན་འདུག་སྟེ་ཆོས་སྟོན་པར་ཀུན་ཏུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་དུ་བལྟ་སྟེ།
en: 95. “Vajrapramardin, if in a dream bodhisattvas perceive themselves teaching the Dharma in the midst of a large group of people, consider those bodhisattvas to be on any of the ten bhūmis.

source: དེས་ས་དག་ལ་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ཡང་། ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པར་བྱ་ཞིང་།
en: They should properly realize what on the bhūmis is the work of Māra and what is karmic obscuration.

source: དེས་སྤོབས་པ་ཡོངས་སུ་བཙལ་བར་བྱ་སྟེ། སྤོབས་པ་རྙེད་ནས་ཀྱང་རྣམ་པར་ངེས་པར་སྒྲུབ་པའི་ལུང་དབོག་པར་བྱའོ། །
en: They should also strive for confident eloquence, and once they have found it, offer instructions that establish certainty.

source: དངོས་པོ་ཐམས་ཅད་ལ་ཡང་ལྷག་པར་ཞེན་པ་མེད་པར་བྱ་ཞིང་། དེས་དངོས་པོ་རྙེད་པ་ལ་ཡང་ཡང་དག་པར་དགའ་བར་འགྱུར་བའི་ངང་ཚུལ་ཅན་དུ་བྱའོ། །
en: Such bodhisattvas should free themselves of excessive clinging to material objects, but still maintain a demeanor in which they are genuinely pleased when they acquire them.

source: སྦྱིན་པའི་གཏམ་སྟོན་པར་ཀུན་ཏུ་ཤེས་ན་ས་དང་པོ་ལ་གནས་པར་འགྱུར་རོ། །
en: “If those bodhisattvas perceive themselves teaching on generosity, they are on the first bhūmi.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱིས་ནི་ས་གཉིས་པར་རོ། །
en: If they teach on the ten virtues, they are on the second bhūmi.

source: ཐོས་པའི་གཏམ་གྱིས་ནི་ས་གསུམ་པར་རོ། །
en: If they teach on learning, they are on the third bhūmi.

source: སྦྱངས་པའི་ཡོན་ཏན་དང་ཡོ་བྱད་བསྙུངས་པའི་གཏམ་གྱིས་ནི་ས་བཞི་པར་རོ། །
en: If they teach on the ascetic practices and austerity, they are on the fourth bhūmi.

source: སྙོམས་པར་འཇུག་པའི་གཏམ་གྱིས་ནི་ས་ལྔ་པར་རོ། །
en: If they teach on equipoise, they are on the fifth bhūmi.

source: ལེགས་པར་སྦྱར་བ་ཡོངས་སུ་རྗོད་པའི་གཏམ་གྱིས་ནི་ས་དྲུག་པར་རོ། །
en: If they teach using well-crafted expressions, they are on the sixth bhūmi.

source: བདག་མེད་པའི་གཏམ་གྱིས་ནི་ས་བདུན་པར་རོ། །
en: If they teach on the absence of self, they are on the seventh bhūmi.

source: ཡེ་ཤེས་བཀོད་པའི་གཏམ་གྱིས་ནི་ས་བརྒྱད་པར་རོ། །
en: If they teach on the array of wisdom, they are on the eighth bhūmi.

source: སངས་རྒྱས་བཀོད་པའི་གཏམ་གྱིས་ནི་ས་དགུ་པར་རོ། །
en: If they teach on the array of buddhas, they are on the ninth bhūmi.

source: ལུས་ཀྱི་ཚད་ཀྱི་གཏམ་གྱིས་ནི་ས་བཅུ་པར་རོ། །
en: If they teach on the size of bodies, they are on the tenth bhūmi.

source: ས་དང་པོ་ལ་ནི་ཡོ་བྱད་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: “On the first bhūmi those bodhisattvas seek possessions.

source: ས་གཉིས་པ་ལ་ནི་ཚུལ་ཁྲིམས་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the second bhūmi they strive for discipline.

source: ས་གསུམ་པ་ལ་ནི་འོད་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the third bhūmi they strive for light.

source: ས་བཞི་པ་ལ་ནི་ནོར་བདུན་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the fourth bhūmi they strive for the seven riches.

source: ས་ལྔ་པ་ལ་ནི་མི་གནས་པ་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the fifth bhūmi they strive to not remain anywhere.

source: ས་དྲུག་པ་ལ་ནི་རྣམ་པར་གཏན་ལ་དབབ་པ་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the sixth bhūmi they strive for ascertainment.

source: ས་བདུན་པ་ལ་ནི་ངེས་པ་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the seventh bhūmi they strive for certainty.

source: ས་བརྒྱད་པ་ལ་ནི་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the eighth bhūmi they strive for superknowledge and the discernments.

source: ས་དགུ་པ་ལ་ནི་སྤྱོད་པ་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the ninth bhūmi they strive for proper conduct.

source: ས་བཅུ་པ་ལ་ནི་ཚད་མེད་པ་ལ་རྩོལ་བ་དང་བཅས་པའོ། །
en: On the tenth bhūmi they strive for the immeasurable.

source: དེའི་ས་དང་པོ་ལ་ནི་དགེ་བའི་རྩ་བ་ལ་བར་ཆད་ཡོད་དོ། །
en: “On the first bhūmi those bodhisattvas’ virtuous roots are obstructed.

source: ས་གཉིས་པ་ལ་ནི་ཚུལ་ཁྲིམས་ལ་བར་ཆད་ཡོད་དོ། །
en: On the second bhūmi their discipline is obstructed.

source: ས་གསུམ་པ་ལ་ནི་མངོན་པར་བརྩོན་པ་ལ་བར་ཆད་ཡོད་དོ། །
en: On the third bhūmi their effort is obstructed.

source: ས་བཞི་པ་ལ་ནི་དམིགས་པ་ལ་བར་ཆད་ཡོད་དོ། །
en: On the fourth bhūmi their conceptual perception is obstructed.

source: ས་ལྔ་པ་ལ་ནི་རྣམ་པ་ལ་བར་ཆད་ཡོད་དོ། །
en: On the fifth bhūmi, their features are obstructed.

source: ས་དྲུག་པ་ལ་ནི་ཟབ་མོའི་བཟོད་པ་ལ་བར་ཆད་ཡོད་དོ། །
en: On the sixth bhūmi their acceptance of the profound is obstructed.

source: ས་བདུན་པ་ལ་ནི་རྣམ་པར་འབྱེད་པའི་ཡེ་ཤེས་ལ་བར་ཆད་ཡོད་དོ། །
en: On the seventh bhūmi their discriminating wisdom is obstructed.

source: ས་བརྒྱད་པ་ལ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བར་ཆད་ཡོད་དོ། །
en: On the eighth bhūmi their capacity to ripen beings is obstructed.

source: ས་དགུ་པ་ལ་ནི་རྣམ་པར་ཤེས་པའི་ཚོགས་ལ་བར་ཆད་ཡོད་དོ། །
en: On the ninth bhūmi their collection of consciousnesses is obstructed.

source: ས་བཅུ་པ་ལ་ནི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་བར་ཆད་ཡོད་དོ། །
en: On the tenth bhūmi their capacity to purify buddhafields is obstructed.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གྲོང་ཁྱེར་ན་གནས་པར་བྱེད་པར་ཀུན་ཏུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པོ་དག་ལ་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་དུ་ཉེ་བ་ཡིན་ཏེ།
en: 96. “Vajrapramardin, if in a dream bodhisattvas perceive themselves living in a city, those bodhisattvas are close to being predicted as being irreversible from the first eight bhūmis.

source: དེས་ནི་ཟབ་མོ་ལ་མོས་པའི་གང་ཟག་ལ་བསྟེན་པར་བྱ་ཞིང་། བསྙེན་བཀུར་བྱ། མཆོད་པར་བྱའོ། །
en: They should rely on, serve, and revere people who are dedicated to the profound.

source: ཆོས་ལ་ཐེ་ཙོམ་མང་ཞིང་སྒྲིབ་པ་ཡོད་པས་དེས་ཆོས་སྨྲ་བ་ལ་བསྟེན་ཅིང་བསྙེན་བཀུར་བྱེད།
en: Such bodhisattvas have many doubts about the Dharma and many obscurations.

source: མཆོད་པར་བྱེད་ན་འགྱོད་པ་སེལ་བར་འགྱུར་ལ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: If they rely on, serve, and revere Dharma teachers, their regrets will be dispelled, their related karmic obscurations will be purified, and they will find release in awakening.

source: དེ་ལ་ས་དང་པོ་ལ་གནས་པ་ནི་སངས་རྒྱས་སུ་འགྱུར་རམ། འོན་ཀྱང་མི་འགྱུར་སྙམ་དུ་བྱང་ཆུབ་ལ་ཐེ་ཙོམ་ཟའོ། །
en: “Bodhisattvas on the first bhūmi have doubts about awakening, wondering if they will or will not become a buddha.

source: ས་གཉིས་པ་ལ་གནས་པ་ནི་ཡང་དག་པར་བླང་བ་ལ་ཐེ་ཙོམ་ཟའོ། །
en: On the second bhūmi they have doubts about their obligations.

source: ས་གསུམ་པ་ལ་གནས་པ་ནི་ཡེ་ཤེས་ལ་ཐེ་ཙོམ་ཟའོ། །
en: On the third bhūmi they have doubts about wisdom.

source: ས་བཞི་པ་ལ་གནས་པ་ནི་ཏིང་ངེ་འཛིན་སྒྲུབ་པ་ལ་ཐེ་ཙོམ་ཟའོ། །
en: On the fourth bhūmi, they have doubts about mastering samādhi.

source: ས་ལྔ་པ་ལ་གནས་པ་ནི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་གྱི་ཤེས་པ་ལ་ཐེ་ཙོམ་ཟའོ། །
en: On the fifth bhūmi they have doubts about knowing how things truly are.

source: ས་དྲུག་པ་ལ་གནས་པ་ནི་ལམ་དང་འབྲས་བུ་ལ་ཐེ་ཙོམ་ཟའོ། །
en: On the sixth bhūmi they have doubts about the path and fruition.

source: ས་བདུན་པ་ལ་གནས་པ་ནི་ངེས་པའི་ཚིག་ལ་ཐེ་ཙོམ་ཟའོ། །
en: On the seventh bhūmi they have doubts about linguistic analysis.

source: ས་བརྒྱད་པ་ལ་གནས་པ་ནི་རྣམ་པར་འཕྲུལ་བ་ལ་ཐེ་ཙོམ་ཟའོ། །
en: On the eighth bhūmi they have doubts about miraculous displays. 97.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཟམ་པ་འདོགས་ཤིང་ཆུ་བོའི་དབུས་སུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves constructing a bridge and walking out to the middle of water, consider those bodhisattvas to be on one of the first seven bhūmis.

source: དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཤས་ཆེ་ཞིང་བདུད་ཀྱི་ལས་ཀྱང་ཤས་ཆེ་བས་དེས་ནི་འདུན་པ་དྲག་པོར་བྱ་ཞིང་རྟེན་པ་མེད་པ་དང་།
en: They are dominated by karmic obscurations and by the activity of Māra.

source: དབྱེ་བ་ལ་མི་གནས་པར་བྱ་བ་དང་།
en: Such bodhisattvas should then be fiercely determined, act independently and without maintaining distinctions, and make an effort in the accumulations.

source: ཚོགས་པ་ལ་མངོན་པར་བརྩོན་པར་བྱས་ན་མི་སྐྱེ་བའི་ཆོས་ཀྱི་སྣང་བ་རྣམ་པར་དག་པར་འགྱུར་རོ། །
en: By doing so, they will purify the light of unarisen phenomena.

source: གང་གིས་ཤེས་པའི་སྣང་བ་ལ་བར་ཆད་ཡོད་པ་དེ་ནི་ས་དང་པོར་རོ། །
en: “If they have obstacles to the light of understanding, those bodhisattvas are on the first bhūmi.

source: གང་གིས་ཇི་ལྟར་བརྩོན་པའི་དགེ་བའི་རྩ་བ་ལ་ལུས་ཉམས་བདེ་བ་མེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they do not experience physical pleasure in the virtuous root of appropriate effort, they are on the second bhūmi.
